In [1]:
import seaborn as sns
import pandas as pd

In [38]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
deck = df['deck'].value_counts

In [5]:
# isnull(), notnull()은 체이닝 메서드 방식이다.
# 체이닝 메서드 : return된 값을 바탕으로 연쇄적으로 함수를 돌리는 방식

In [6]:
df.head().isnull() # missing(누락) 데이터는 True, valid(유효한) 데이터는 False

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [7]:
df.head().notnull() # valid(유효한) 데이터는 True, missing(누락) 데이터는 False

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True

In [8]:
df.head().isnull().sum(axis=0)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

In [9]:
df.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [10]:
df.isnull().sum(axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [11]:
df_thresh = df.dropna(axis=1, thresh=500)
df_thresh.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [12]:
df_age = df.dropna(subset=['age'], how = 'any', axis = 0)
print(df_age)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[714 rows x 15 columns]

In [41]:
평균 = df['age'].mean(axis=0)
fill_age_df = df['age'].fillna(평균, inplace=True) # inplace = 데이터 수정

C:\Users\ktw80\AppData\Local\Temp\ipykernel_17872\1712104453.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  fill_age_df = df['age'].fillna(평균, inplace=True) # inplace = 데이터 수정

In [49]:
df['embark_town'][825:826]

825    Queenstown
Name: embark_town, dtype: object

In [31]:
df['embarked'][825:835]

825      Q
826      S
827      C
828      Q
829    NaN
830      C
831      S
832      C
833      S
834      S
Name: embarked, dtype: object

In [54]:
# 'age' 열의 NaN 값을 평균 나이로 채우기
df['age'].fillna(df['age'].mean(), inplace=True)

# 'embarked' 열의 NaN 값을 가장 빈번한 값으로 채우기
most_frequent = df['embarked'].mode()[0]
df['embarked'].fillna(most_frequent, inplace=True)

# 'deck' 열의 NaN 값을 'Unknown'으로 채우기
df['deck']=df['deck'].astype('object')
df['deck'].fillna('Unknown', inplace=True)

C:\Users\ktw80\AppData\Local\Temp\ipykernel_17872\3342976227.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(), inplace=True)
C:\Users\ktw80\AppData\Local\Temp\ipykernel_17872\3342976227.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['embarked'].fillna(most_frequent, inplace=True)
C:\Users\ktw80\AppData\Local\Temp\ipykernel_17872\3342976227.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['deck'].fillna('Unknown', inplace=True)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(6)
memory usage: 86.4+ KB

In [58]:
'''
참고

Nan 누락이 아닌 데이터( 숫자, 기호 등 ) 으로 표시된 데이터는
Nan으로 바꿔주고 fillna(inplace=True)로 수정해주자

'''

'\n참고\n\nNan 누락이 아닌 데이터( 숫자, 기호 등 ) 으로 표시된 데이터는\nNan으로 바꿔주고 fillna(inplace=True)로 수정해주자\n\n'

In [ ]:
from sklearn.impute import SimpleImputer
import numpy as np
import pandas as pd

# 예제 데이터 프레임 생성
df = pd.DataFrame({
    'age': [25, np.nan, 27, 29, 32],
    'salary': [50000, 54000, np.nan, np.nan, 58000],
    'gender': ['male', 'female', 'female', 'male', np.nan]
})

# 숫자형 열에 대한 imputer 생성 (평균으로 채우기)
num_imputer = SimpleImputer(strategy='mean')

# 숫자형 열만 선택
num_columns = df.select_dtypes(include=['float64', 'int64']).columns

# 숫자형 열에 imputer 적용
df[num_columns] = num_imputer.fit_transform(df[num_columns])

# 결과 확인
print(df)

In [61]:
df_dup = df.duplicated()
print(df_dup)

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [64]:
# 데이터 표준화

'''

데이터가 잘 정리된 것 처럼 보여도 서로 다른 단위가 섞여있거나 같은 대상으 다른 형식으로 표현하는 경우가 의외로 많다.

동일한 대상을 표현하는 방법에 차이가 있으면 분석(예측) 정확도는 현저히 낮아진다.

데이터 포맷을 일관성 있게 표준화하는 작업이 필요하다.

데이터의 출처 또는 데이터에 대한 실행이 반드시 필요!

'''

'\n\n데이터가 잘 정리된 것 처럼 보여도 서로 다른 단위가 섞여있거나 같은 대상으 다른 형식으로 표현하는 경우가 의외로 많다.\n\n동일한 대상을 표현하는 방법에 차이가 있으면 분석(예측) 정확도는 현저히 낮아진다.\n\n데이터 포맷을 일관성 있게 표준화하는 작업이 필요하다.\n\n데이터의 출처 또는 데이터에 대한 실행이 반드시 필요!\n\n'

Additional Variable Information
   
    1. mpg 연비 :           continuous
   
    2. cylinders 실린더수 :     multi-valued discrete
   
    3. displacement 배기량 :  continuous
   
    4. horsepower 마력:    continuous
   
    5. weight 차중 :        continuous
   
    6. acceleration 가속 :  continuous
   
    7. model year 제작년도 :    multi-valued discrete
   
    8. origin 생산지역 :        multi-valued discrete

    9. car name 차명 :      string (unique for each instance)

In [ ]:
df = pd.read_csv("./auto-mpg/auto-mpg.data")
df.columns = ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'model year', 'origin', 'car name']

    18.0   8   307.0      130.0      3504.      12.0   70  1\t"chevrolet chevelle malibu"
0    15.0   8   350.0      165.0      3693.      11...
1    18.0   8   318.0      150.0      3436.      11...
2    16.0   8   304.0      150.0      3433.      12...
3    17.0   8   302.0      140.0      3449.      10...
4    15.0   8   429.0      198.0      4341.      10...
..                                                 ...
392  27.0   4   140.0      86.00      2790.      15...
393  44.0   4   97.00      52.00      2130.      24...
394  32.0   4   135.0      84.00      2295.      11...
395  28.0   4   120.0      79.00      2625.      18...
396  31.0   4   119.0      82.00      2720.      19...

[397 rows x 1 columns]

In [86]:
feature_name = df.columns

In [87]:
mpg_to_kpl = 1.60934 / 3.78541

df2 = df.copy() # csv 파일을 복사하여 df2에 저장

df2['kpl'] = df2.mpg * mpg_to_kpl

df2.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.652571
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.377143
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.652571

In [89]:
import numpy as np

df3 = df.copy()

df3.horsepower.replace('?', np.nan, inplace=True) # 위에서 언급했던 기호를 Nan으로 바꾸기

df3.horsepower.unique()

C:\Users\ktw80\AppData\Local\Temp\ipykernel_17872\4178703004.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df3.horsepower.replace('?', np.nan, inplace=True) # 위에서 언급했던 기호를 Nan으로 바꾸기

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', nan, '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [91]:
df3.dropna(subset='horsepower', axis=0, inplace=True)
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    object
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    int64
 8   car name      392 non-null    object
 9   kpl           392 non-null    float64
dtypes: float64(5), int64(3), object(2)
memory usage: 33.7+ KB

In [92]:
import pandas as pd

# 샘플 DataFrame 생성
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

# 열 'B'를 삭제하지만 원본 DataFrame은 변경하지 않음
new_df = df.drop('B', axis=1, inplace=False)

print("원본 DataFrame:")
print(df)
print("\n변경된 DataFrame:")
print(new_df)

원본 DataFrame:
   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

변경된 DataFrame:
   A  C
0  1  7
1  2  8
2  3  9

In [93]:
import pandas as pd

# 샘플 DataFrame 생성
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

# 열 'B'를 삭제하지만 원본 DataFrame은 변경하지 않음
new_df = df.drop('B', axis=1, inplace=True)

print("원본 DataFrame:")
print(df)
print("\n변경된 DataFrame:")
print(new_df)

원본 DataFrame:
   A  C
0  1  7
1  2  8
2  3  9

변경된 DataFrame:
None

In [95]:
# 기술 통계
df3.horsepower.describe()

count       392
unique       93
top       150.0
freq         22
Name: horsepower, dtype: object

In [97]:
'''
각 컬럼 데이터에서 해당 열의 최솟값을 뺀 값을 분자

해당 열의 최댓값과 최솟값의 차이를 분모로 하여 0과 1 사이의 값으로 변환

가장 큰값은 역시 1이 됨
'''

'\n각 컬럼 데이터에서 해당 열의 최솟값을 뺀 값을 분자\n\n해당 열의 최댓값과 최솟값의 차이를 분모로 하여 0과 1 사이의 값으로 변환\n\n가장 큰값은 역시 1이 됨\n'

In [110]:
df4 = df3.copy()
df4['horsepower'] = pd.to_numeric(df4['horsepower'], errors='coerce')
numerator = df4['horsepower'] - df4['horsepower'].min()
print(numerator)

0       84.0
1      119.0
2      104.0
3      104.0
4       94.0
       ...
393     40.0
394      6.0
395     38.0
396     33.0
397     36.0
Name: horsepower, Length: 392, dtype: float64

In [113]:
df4.horsepower.describe()

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [115]:
df2.horsepower.replace('?', np.nan, inplace=True)
df2.dropna(subset=['horsepower'], axis=0, inplace=True)
df2.horsepower = df2.horsepower.astype('float')
df2.horsepower.unique()

C:\Users\ktw80\AppData\Local\Temp\ipykernel_17872\615353775.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2.horsepower.replace('?', np.nan, inplace=True)

array([130., 165., 150., 140., 198., 220., 215., 225., 190., 170., 160.,
        95.,  97.,  85.,  88.,  46.,  87.,  90., 113., 200., 210., 193.,
       100., 105., 175., 153., 180., 110.,  72.,  86.,  70.,  76.,  65.,
        69.,  60.,  80.,  54., 208., 155., 112.,  92., 145., 137., 158.,
       167.,  94., 107., 230.,  49.,  75.,  91., 122.,  67.,  83.,  78.,
        52.,  61.,  93., 148., 129.,  96.,  71.,  98., 115.,  53.,  81.,
        79., 120., 152., 102., 108.,  68.,  58., 149.,  89.,  63.,  48.,
        66., 139., 103., 125., 133., 138., 135., 142.,  77.,  62., 132.,
        84.,  64.,  74., 116.,  82.])

In [153]:
bin_names = ['저출력', '보통출력', '고출력']
bins = [0, 120, 200, 500]
bin_dividers = pd.cut(x=df2['horsepower'], bins=bins, labels=bin_names, include_lowest=True)

In [158]:
df2[['horsepower', 'hp_bin']].head(15)

    horsepower hp_bin
0        130.0   보통출력
1        165.0   보통출력
2        150.0   보통출력
3        150.0   보통출력
4        140.0   보통출력
5        198.0   보통출력
6        220.0    고출력
7        215.0    고출력
8        225.0    고출력
9        190.0   보통출력
10       170.0   보통출력
11       160.0   보통출력
12       150.0   보통출력
13       225.0    고출력
14        95.0    저출력

In [165]:
horsepower_dummies = pd.get_dummies(df2['hp_bin'], dtype='int')

horsepower_dummies.head(15)

    저출력  보통출력  고출력
0     0     1    0
1     0     1    0
2     0     1    0
3     0     1    0
4     0     1    0
5     0     1    0
6     0     0    1
7     0     0    1
8     0     0    1
9     0     1    0
10    0     1    0
11    0     1    0
12    0     1    0
13    0     0    1
14    1     0    0